Revit 2024 API
ParameterTypeId.FabricationProductDataFinishDescription Property
 "Product Finish Description"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId FabricationProductDataFinishDescription { get; }
Visual Basic
Public Shared ReadOnly Property FabricationProductDataFinishDescription As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ FabricationProductDataFinishDescription {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace